# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nvm'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'youtube-dl'
# brew 'zlib' # Needed for Memcached

# # Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# # Development
# brew 'php'
# brew 'php@7.4'
# brew 'php@7.3'
# brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'meilisearch'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'rider'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-meslo-for-powerline'

# Mac App Store
mas 'Be Focused Pro', id: 961632517
mas 'Bear', id: 1091189122
mas 'Day One', id: 1055511498
mas 'Fantastical', id: 975937182
mas 'Microsoft RDP', id: 1295203466
mas 'Moom', id: 419330170

cask 'microsoft-office' # move to end because of prompt